Aghosh993/Athena/arch/tivaware_tm4c/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the EMAC API.
//
//*****************************************************************************
#ifdef ROM_EMACIntStatus
#define MAP_EMACIntStatus                                                     \
        ROM_EMACIntStatus
#else
#define MAP_EMACIntStatus                                                     \
        EMACIntStatus
#endif
#ifdef ROM_EMACAddrGet
#define MAP_EMACAddrGet                                                       \
        ROM_EMACAddrGet
#else
#define MAP_EMACAddrGet                                                       \
        EMACAddrGet
#endif
#ifdef ROM_EMACAddrSet
#define MAP_EMACAddrSet                                                       \
        ROM_EMACAddrSet
#else
#define MAP_EMACAddrSet                                                       \
        EMACAddrSet
#endif
#ifdef ROM_EMACConfigGet
#define MAP_EMACConfigGet                                                     \
        ROM_EMACConfigGet
#else
#define MAP_EMACConfigGet                                                     \
        EMACConfigGet
#endif
#ifdef ROM_EMACConfigSet
#define MAP_EMACConfigSet                                                     \
        ROM_EMACConfigSet
#else
#define MAP_EMACConfigSet                                                     \
        EMACConfigSet
#endif
#ifdef ROM_EMACDMAStateGet
#define MAP_EMACDMAStateGet                                                   \
        ROM_EMACDMAStateGet
#else
#define MAP_EMACDMAStateGet                                                   \
        EMACDMAStateGet
#endif
#ifdef ROM_EMACFrameFilterGet
#define MAP_EMACFrameFilterGet                                                \
        ROM_EMACFrameFilterGet
#else
#define MAP_EMACFrameFilterGet                                                \
        EMACFrameFilterGet
#endif
#ifdef ROM_EMACFrameFilterSet
#define MAP_EMACFrameFilterSet                                                \
        ROM_EMACFrameFilterSet
#else
#define MAP_EMACFrameFilterSet                                                \
        EMACFrameFilterSet
#endif
#ifdef ROM_EMACInit
#define MAP_EMACInit                                                          \
        ROM_EMACInit
#else
#define MAP_EMACInit                                                          \
        EMACInit
#endif
#ifdef ROM_EMACIntClear
#define MAP_EMACIntClear                                                      \
        ROM_EMACIntClear
#else
#define MAP_EMACIntClear                                                      \
        EMACIntClear
#endif
#ifdef ROM_EMACIntDisable
#define MAP_EMACIntDisable                                                    \
        ROM_EMACIntDisable
#else
#define MAP_EMACIntDisable                                                    \
        EMACIntDisable
#endif
#ifdef ROM_EMACIntEnable
#define MAP_EMACIntEnable                                                     \
        ROM_EMACIntEnable
#else
#define MAP_EMACIntEnable                                                     \
        EMACIntEnable
#endif
#ifdef ROM_EMACPHYConfigSet
#define MAP_EMACPHYConfigSet                                                  \
        ROM_EMACPHYConfigSet
#else
#define MAP_EMACPHYConfigSet                                                  \
        EMACPHYConfigSet
#endif
#ifdef ROM_EMACPHYPowerOff
#define MAP_EMACPHYPowerOff                                                   \
        ROM_EMACPHYPowerOff
#else
#define MAP_EMACPHYPowerOff                                                   \
        EMACPHYPowerOff
#endif
#ifdef ROM_EMACPHYPowerOn
#define MAP_EMACPHYPowerOn                                                    \
        ROM_EMACPHYPowerOn
#else
#define MAP_EMACPHYPowerOn                                                    \
        EMACPHYPowerOn
#endif
#ifdef ROM_EMACPHYRead
#define MAP_EMACPHYRead                                                       \
        ROM_EMACPHYRead
#else
#define MAP_EMACPHYRead                                                       \
        EMACPHYRead
#endif
#ifdef ROM_EMACPHYWrite
#define MAP_EMACPHYWrite                                                      \
        ROM_EMACPHYWrite
#else
#define MAP_EMACPHYWrite                                                      \
        EMACPHYWrite
#endif
#ifdef ROM_EMACReset
#define MAP_EMACReset                                                         \
        ROM_EMACReset
#else
#define MAP_EMACReset                                                         \
        EMACReset
#endif
#ifdef ROM_EMACRxDisable
#define MAP_EMACRxDisable                                                     \
        ROM_EMACRxDisable
#else
#define MAP_EMACRxDisable                                                     \
        EMACRxDisable
#endif
#ifdef ROM_EMACRxDMACurrentBufferGet
#define MAP_EMACRxDMACurrentBufferGet                                         \
        ROM_EMACRxDMACurrentBufferGet
#else
#define MAP_EMACRxDMACurrentBufferGet                                         \
        EMACRxDMACurrentBufferGet
#endif
#ifdef ROM_EMACRxDMACurrentDescriptorGet
#define MAP_EMACRxDMACurrentDescriptorGet                                     \
        ROM_EMACRxDMACurrentDescriptorGet
#else
#define MAP_EMACRxDMACurrentDescriptorGet                                     \
        EMACRxDMACurrentDescriptorGet
#endif
#ifdef ROM_EMACRxDMADescriptorListGet
#define MAP_EMACRxDMADescriptorListGet                                        \
        ROM_EMACRxDMADescriptorListGet
#else
#define MAP_EMACRxDMADescriptorListGet                                        \
        EMACRxDMADescriptorListGet
#endif
#ifdef ROM_EMACRxDMADescriptorListSet
#define MAP_EMACRxDMADescriptorListSet                                        \
        ROM_EMACRxDMADescriptorListSet
#else
#define MAP_EMACRxDMADescriptorListSet                                        \
        EMACRxDMADescriptorListSet
#endif
#ifdef ROM_EMACRxDMAPollDemand
#define MAP_EMACRxDMAPollDemand                                               \
        ROM_EMACRxDMAPollDemand
#else
#define MAP_EMACRxDMAPollDemand                                               \
        EMACRxDMAPollDemand
#endif
#ifdef ROM_EMACRxEnable
#define MAP_EMACRxEnable                                                      \
        ROM_EMACRxEnable
#else
#define MAP_EMACRxEnable                                                      \
        EMACRxEnable
#endif
#ifdef ROM_EMACRxWatchdogTimerSet
#define MAP_EMACRxWatchdogTimerSet                                            \
        ROM_EMACRxWatchdogTimerSet
#else
#define MAP_EMACRxWatchdogTimerSet                                            \
        EMACRxWatchdogTimerSet
#endif
#ifdef ROM_EMACStatusGet
#define MAP_EMACStatusGet                                                     \
        ROM_EMACStatusGet
#else
#define MAP_EMACStatusGet                                                     \
        EMACStatusGet
#endif
#ifdef ROM_EMACTxDisable
#define MAP_EMACTxDisable                                                     \
        ROM_EMACTxDisable
#else
#define MAP_EMACTxDisable                                                     \
        EMACTxDisable
#endif
#ifdef ROM_EMACTxDMACurrentBufferGet
#define MAP_EMACTxDMACurrentBufferGet                                         \
        ROM_EMACTxDMACurrentBufferGet
#else
#define MAP_EMACTxDMACurrentBufferGet                                         \
        EMACTxDMACurrentBufferGet
#endif
#ifdef ROM_EMACTxDMACurrentDescriptorGet
#define MAP_EMACTxDMACurrentDescriptorGet                                     \
        ROM_EMACTxDMACurrentDescriptorGet
#else
#define MAP_EMACTxDMACurrentDescriptorGet                                     \
        EMACTxDMACurrentDescriptorGet
#endif
#ifdef ROM_EMACTxDMADescriptorListGet
#define MAP_EMACTxDMADescriptorListGet                                        \
        ROM_EMACTxDMADescriptorListGet
#else
#define MAP_EMACTxDMADescriptorListGet                                        \
        EMACTxDMADescriptorListGet
#endif
#ifdef ROM_EMACTxDMADescriptorListSet
#define MAP_EMACTxDMADescriptorListSet                                        \
        ROM_EMACTxDMADescriptorListSet
#else
#define MAP_EMACTxDMADescriptorListSet                                        \
        EMACTxDMADescriptorListSet
#endif
#ifdef ROM_EMACTxDMAPollDemand
#define MAP_EMACTxDMAPollDemand                                               \
        ROM_EMACTxDMAPollDemand
#else
#define MAP_EMACTxDMAPollDemand                                               \
        EMACTxDMAPollDemand
#endif
#ifdef ROM_EMACTxEnable
#define MAP_EMACTxEnable                                                      \
        ROM_EMACTxEnable
#else
#define MAP_EMACTxEnable                                                      \
        EMACTxEnable
#endif
#ifdef ROM_EMACTxFlush
#define MAP_EMACTxFlush                                                       \
        ROM_EMACTxFlush
#else
#define MAP_EMACTxFlush                                                       \
        EMACTxFlush
#endif
#ifdef ROM_EMACAddrFilterGet
#define MAP_EMACAddrFilterGet                                                 \
        ROM_EMACAddrFilterGet
#else
#define MAP_EMACAddrFilterGet                                                 \
        EMACAddrFilterGet
#endif
#ifdef ROM_EMACAddrFilterSet
#define MAP_EMACAddrFilterSet                                                 \
        ROM_EMACAddrFilterSet
#else
#define MAP_EMACAddrFilterSet                                                 \
        EMACAddrFilterSet
#endif
#ifdef ROM_EMACHashFilterBitCalculate
#define MAP_EMACHashFilterBitCalculate                                        \
        ROM_EMACHashFilterBitCalculate
#else
#define MAP_EMACHashFilterBitCalculate                                        \
        EMACHashFilterBitCalculate
#endif
#ifdef ROM_EMACHashFilterGet
#define MAP_EMACHashFilterGet                                                 \
        ROM_EMACHashFilterGet
#else
#define MAP_EMACHashFilterGet                                                 \
        EMACHashFilterGet
#endif
#ifdef ROM_EMACHashFilterSet
#define MAP_EMACHashFilterSet                                                 \
        ROM_EMACHashFilterSet
#else
#define MAP_EMACHashFilterSet                                                 \
        EMACHashFilterSet
#endif
#ifdef ROM_EMACNumAddrGet
#define MAP_EMACNumAddrGet                                                    \
        ROM_EMACNumAddrGet
#else
#define MAP_EMACNumAddrGet                                                    \
        EMACNumAddrGet
#endif
#ifdef ROM_EMACPHYExtendedRead
#define MAP_EMACPHYExtendedRead                                               \
        ROM_EMACPHYExtendedRead
#else
#define MAP_EMACPHYExtendedRead                                               \
        EMACPHYExtendedRead
#endif
#ifdef ROM_EMACPHYExtendedWrite
#define MAP_EMACPHYExtendedWrite                                              \
        ROM_EMACPHYExtendedWrite
#else
#define MAP_EMACPHYExtendedWrite                                              \
        EMACPHYExtendedWrite
#endif
#ifdef ROM_EMACPowerManagementControlGet
#define MAP_EMACPowerManagementControlGet                                     \
        ROM_EMACPowerManagementControlGet
#else
#define MAP_EMACPowerManagementControlGet                                     \
        EMACPowerManagementControlGet
#endif
#ifdef ROM_EMACPowerManagementControlSet
#define MAP_EMACPowerManagementControlSet                                     \
        ROM_EMACPowerManagementControlSet
#else
#define MAP_EMACPowerManagementControlSet                                     \
        EMACPowerManagementControlSet
#endif
#ifdef ROM_EMACPowerManagementStatusGet
#define MAP_EMACPowerManagementStatusGet                                      \
        ROM_EMACPowerManagementStatusGet
#else
#define MAP_EMACPowerManagementStatusGet                                      \
        EMACPowerManagementStatusGet
#endif
#ifdef ROM_EMACRemoteWakeUpFrameFilterGet
#define MAP_EMACRemoteWakeUpFrameFilterGet                                    \
        ROM_EMACRemoteWakeUpFrameFilterGet
#else
#define MAP_EMACRemoteWakeUpFrameFilterGet                                    \
        EMACRemoteWakeUpFrameFilterGet
#endif
#ifdef ROM_EMACRemoteWakeUpFrameFilterSet
#define MAP_EMACRemoteWakeUpFrameFilterSet                                    \
        ROM_EMACRemoteWakeUpFrameFilterSet
#else
#define MAP_EMACRemoteWakeUpFrameFilterSet                                    \
        EMACRemoteWakeUpFrameFilterSet
#endif
#ifdef ROM_EMACTimestampAddendSet
#define MAP_EMACTimestampAddendSet                                            \
        ROM_EMACTimestampAddendSet
#else
#define MAP_EMACTimestampAddendSet                                            \
        EMACTimestampAddendSet
#endif
#ifdef ROM_EMACTimestampConfigGet
#define MAP_EMACTimestampConfigGet                                            \
        ROM_EMACTimestampConfigGet
#else
#define MAP_EMACTimestampConfigGet                                            \
        EMACTimestampConfigGet
#endif
#ifdef ROM_EMACTimestampConfigSet
#define MAP_EMACTimestampConfigSet                                            \
        ROM_EMACTimestampConfigSet
#else
#define MAP_EMACTimestampConfigSet                                            \
        EMACTimestampConfigSet
#endif
#ifdef ROM_EMACTimestampDisable
#define MAP_EMACTimestampDisable                                              \
        ROM_EMACTimestampDisable
#else
#define MAP_EMACTimestampDisable                                              \
        EMACTimestampDisable
#endif
#ifdef ROM_EMACTimestampEnable
#define MAP_EMACTimestampEnable                                               \
        ROM_EMACTimestampEnable
#else
#define MAP_EMACTimestampEnable                                               \
        EMACTimestampEnable
#endif
#ifdef ROM_EMACTimestampIntStatus
#define MAP_EMACTimestampIntStatus                                            \
        ROM_EMACTimestampIntStatus
#else
#define MAP_EMACTimestampIntStatus                                            \
        EMACTimestampIntStatus
#endif
#ifdef ROM_EMACTimestampPPSCommand
#define MAP_EMACTimestampPPSCommand                                           \
        ROM_EMACTimestampPPSCommand
#else
#define MAP_EMACTimestampPPSCommand                                           \
        EMACTimestampPPSCommand
#endif
#ifdef ROM_EMACTimestampPPSCommandModeSet
#define MAP_EMACTimestampPPSCommandModeSet                                    \
        ROM_EMACTimestampPPSCommandModeSet
#else
#define MAP_EMACTimestampPPSCommandModeSet                                    \
        EMACTimestampPPSCommandModeSet
#endif
#ifdef ROM_EMACTimestampPPSPeriodSet
#define MAP_EMACTimestampPPSPeriodSet                                         \
        ROM_EMACTimestampPPSPeriodSet
#else
#define MAP_EMACTimestampPPSPeriodSet                                         \
        EMACTimestampPPSPeriodSet
#endif
#ifdef ROM_EMACTimestampPPSSimpleModeSet
#define MAP_EMACTimestampPPSSimpleModeSet                                     \
        ROM_EMACTimestampPPSSimpleModeSet
#else
#define MAP_EMACTimestampPPSSimpleModeSet                                     \
        EMACTimestampPPSSimpleModeSet
#endif
#ifdef ROM_EMACTimestampSysTimeGet
#define MAP_EMACTimestampSysTimeGet                                           \
        ROM_EMACTimestampSysTimeGet
#else
#define MAP_EMACTimestampSysTimeGet                                           \
        EMACTimestampSysTimeGet
#endif
#ifdef ROM_EMACTimestampSysTimeSet
#define MAP_EMACTimestampSysTimeSet                                           \
        ROM_EMACTimestampSysTimeSet
#else
#define MAP_EMACTimestampSysTimeSet                                           \
        EMACTimestampSysTimeSet
#endif
#ifdef ROM_EMACTimestampSysTimeUpdate
#define MAP_EMACTimestampSysTimeUpdate                                        \
        ROM_EMACTimestampSysTimeUpdate
#else
#define MAP_EMACTimestampSysTimeUpdate                                        \
        EMACTimestampSysTimeUpdate
#endif
#ifdef ROM_EMACTimestampTargetIntDisable
#define MAP_EMACTimestampTargetIntDisable                                     \
        ROM_EMACTimestampTargetIntDisable
#else
#define MAP_EMACTimestampTargetIntDisable                                     \
        EMACTimestampTargetIntDisable
#endif
#ifdef ROM_EMACTimestampTargetIntEnable
#define MAP_EMACTimestampTargetIntEnable                                      \
        ROM_EMACTimestampTargetIntEnable
#else
#define MAP_EMACTimestampTargetIntEnable                                      \
        EMACTimestampTargetIntEnable
#endif
#ifdef ROM_EMACTimestampTargetSet
#define MAP_EMACTimestampTargetSet                                            \
        ROM_EMACTimestampTargetSet
#else
#define MAP_EMACTimestampTargetSet                                            \
        EMACTimestampTargetSet
#endif
#ifdef ROM_EMACVLANHashFilterBitCalculate
#define MAP_EMACVLANHashFilterBitCalculate                                    \
        ROM_EMACVLANHashFilterBitCalculate
#else
#define MAP_EMACVLANHashFilterBitCalculate                                    \
        EMACVLANHashFilterBitCalculate
#endif
#ifdef ROM_EMACVLANHashFilterGet
#define MAP_EMACVLANHashFilterGet                                             \
        ROM_EMACVLANHashFilterGet
#else
#define MAP_EMACVLANHashFilterGet                                             \
        EMACVLANHashFilterGet
#endif
#ifdef ROM_EMACVLANHashFilterSet
#define MAP_EMACVLANHashFilterSet                                             \
        ROM_EMACVLANHashFilterSet
#else
#define MAP_EMACVLANHashFilterSet                                             \
        EMACVLANHashFilterSet
#endif
#ifdef ROM_EMACVLANRxConfigGet
#define MAP_EMACVLANRxConfigGet                                               \
        ROM_EMACVLANRxConfigGet
#else
#define MAP_EMACVLANRxConfigGet                                               \
        EMACVLANRxConfigGet
#endif
#ifdef ROM_EMACVLANRxConfigSet
#define MAP_EMACVLANRxConfigSet                                               \
        ROM_EMACVLANRxConfigSet
#else
#define MAP_EMACVLANRxConfigSet                                               \
        EMACVLANRxConfigSet
#endif
#ifdef ROM_EMACVLANTxConfigGet
#define MAP_EMACVLANTxConfigGet                                               \
        ROM_EMACVLANTxConfigGet
#else
#define MAP_EMACVLANTxConfigGet                                               \
        EMACVLANTxConfigGet
#endif
#ifdef ROM_EMACVLANTxConfigSet
#define MAP_EMACVLANTxConfigSet                                               \
        ROM_EMACVLANTxConfigSet
#else
#define MAP_EMACVLANTxConfigSet                                               \
        EMACVLANTxConfigSet
#endif

//*****************************************************************************
//
// Macros for the Flash API.
//
//*****************************************************************************
#ifdef ROM_FlashProgram
#define MAP_FlashProgram                                                      \
        ROM_FlashProgram
#else
#define MAP_FlashProgram                                                      \
        FlashProgram
#endif
#ifdef ROM_FlashErase
#define MAP_FlashErase                                                        \
        ROM_FlashErase
#else
#define MAP_FlashErase                                                        \
        FlashErase
#endif
#ifdef ROM_FlashProtectGet
#define MAP_FlashProtectGet                                                   \
        ROM_FlashProtectGet
#else
#define MAP_FlashProtectGet                                                   \
        FlashProtectGet
#endif
#ifdef ROM_FlashProtectSet
#define MAP_FlashProtectSet                                                   \
        ROM_FlashProtectSet
#else
#define MAP_FlashProtectSet                                                   \
        FlashProtectSet
#endif
#ifdef ROM_FlashProtectSave
#define MAP_FlashProtectSave                                                  \
        ROM_FlashProtectSave
#else
#define MAP_FlashProtectSave                                                  \
        FlashProtectSave
#endif
#ifdef ROM_FlashUserGet
#define MAP_FlashUserGet                                                      \
        ROM_FlashUserGet
#else
#define MAP_FlashUserGet                                                      \
        FlashUserGet
#endif
#ifdef ROM_FlashUserSet
#define MAP_FlashUserSet                                                      \
        ROM_FlashUserSet
#else
#define MAP_FlashUserSet                                                      \
        FlashUserSet
#endif
#ifdef ROM_FlashUserSave
#define MAP_FlashUserSave                                                     \
        ROM_FlashUserSave
#else
#define MAP_FlashUserSave                                                     \
        FlashUserSave
#endif
#ifdef ROM_FlashIntEnable
#define MAP_FlashIntEnable                                                    \
        ROM_FlashIntEnable
#else
#define MAP_FlashIntEnable                                                    \
        FlashIntEnable
#endif
#ifdef ROM_FlashIntDisable
#define MAP_FlashIntDisable                                                   \
        ROM_FlashIntDisable
#else
#define MAP_FlashIntDisable                                                   \
        FlashIntDisable
#endif
#ifdef ROM_FlashIntStatus
#define MAP_FlashIntStatus                                                    \
        ROM_FlashIntStatus
#else
#define MAP_FlashIntStatus                                                    \
        FlashIntStatus
#endif
#ifdef ROM_FlashIntClear
#define MAP_FlashIntClear                                                     \
        ROM_FlashIntClear
#else
#define MAP_FlashIntClear                                                     \
        FlashIntClear
#endif

