Aghosh993/Athena/arch/tivaware_tm4c/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the Timer API.
//
//*****************************************************************************
#ifdef ROM_TimerIntClear
#define MAP_TimerIntClear                                                     \
        ROM_TimerIntClear
#else
#define MAP_TimerIntClear                                                     \
        TimerIntClear
#endif
#ifdef ROM_TimerEnable
#define MAP_TimerEnable                                                       \
        ROM_TimerEnable
#else
#define MAP_TimerEnable                                                       \
        TimerEnable
#endif
#ifdef ROM_TimerDisable
#define MAP_TimerDisable                                                      \
        ROM_TimerDisable
#else
#define MAP_TimerDisable                                                      \
        TimerDisable
#endif
#ifdef ROM_TimerConfigure
#define MAP_TimerConfigure                                                    \
        ROM_TimerConfigure
#else
#define MAP_TimerConfigure                                                    \
        TimerConfigure
#endif
#ifdef ROM_TimerControlLevel
#define MAP_TimerControlLevel                                                 \
        ROM_TimerControlLevel
#else
#define MAP_TimerControlLevel                                                 \
        TimerControlLevel
#endif
#ifdef ROM_TimerControlTrigger
#define MAP_TimerControlTrigger                                               \
        ROM_TimerControlTrigger
#else
#define MAP_TimerControlTrigger                                               \
        TimerControlTrigger
#endif
#ifdef ROM_TimerControlEvent
#define MAP_TimerControlEvent                                                 \
        ROM_TimerControlEvent
#else
#define MAP_TimerControlEvent                                                 \
        TimerControlEvent
#endif
#ifdef ROM_TimerControlStall
#define MAP_TimerControlStall                                                 \
        ROM_TimerControlStall
#else
#define MAP_TimerControlStall                                                 \
        TimerControlStall
#endif
#ifdef ROM_TimerRTCEnable
#define MAP_TimerRTCEnable                                                    \
        ROM_TimerRTCEnable
#else
#define MAP_TimerRTCEnable                                                    \
        TimerRTCEnable
#endif
#ifdef ROM_TimerRTCDisable
#define MAP_TimerRTCDisable                                                   \
        ROM_TimerRTCDisable
#else
#define MAP_TimerRTCDisable                                                   \
        TimerRTCDisable
#endif
#ifdef ROM_TimerPrescaleSet
#define MAP_TimerPrescaleSet                                                  \
        ROM_TimerPrescaleSet
#else
#define MAP_TimerPrescaleSet                                                  \
        TimerPrescaleSet
#endif
#ifdef ROM_TimerPrescaleGet
#define MAP_TimerPrescaleGet                                                  \
        ROM_TimerPrescaleGet
#else
#define MAP_TimerPrescaleGet                                                  \
        TimerPrescaleGet
#endif
#ifdef ROM_TimerPrescaleMatchSet
#define MAP_TimerPrescaleMatchSet                                             \
        ROM_TimerPrescaleMatchSet
#else
#define MAP_TimerPrescaleMatchSet                                             \
        TimerPrescaleMatchSet
#endif
#ifdef ROM_TimerPrescaleMatchGet
#define MAP_TimerPrescaleMatchGet                                             \
        ROM_TimerPrescaleMatchGet
#else
#define MAP_TimerPrescaleMatchGet                                             \
        TimerPrescaleMatchGet
#endif
#ifdef ROM_TimerLoadSet
#define MAP_TimerLoadSet                                                      \
        ROM_TimerLoadSet
#else
#define MAP_TimerLoadSet                                                      \
        TimerLoadSet
#endif
#ifdef ROM_TimerLoadGet
#define MAP_TimerLoadGet                                                      \
        ROM_TimerLoadGet
#else
#define MAP_TimerLoadGet                                                      \
        TimerLoadGet
#endif
#ifdef ROM_TimerValueGet
#define MAP_TimerValueGet                                                     \
        ROM_TimerValueGet
#else
#define MAP_TimerValueGet                                                     \
        TimerValueGet
#endif
#ifdef ROM_TimerMatchSet
#define MAP_TimerMatchSet                                                     \
        ROM_TimerMatchSet
#else
#define MAP_TimerMatchSet                                                     \
        TimerMatchSet
#endif
#ifdef ROM_TimerMatchGet
#define MAP_TimerMatchGet                                                     \
        ROM_TimerMatchGet
#else
#define MAP_TimerMatchGet                                                     \
        TimerMatchGet
#endif
#ifdef ROM_TimerIntEnable
#define MAP_TimerIntEnable                                                    \
        ROM_TimerIntEnable
#else
#define MAP_TimerIntEnable                                                    \
        TimerIntEnable
#endif
#ifdef ROM_TimerIntDisable
#define MAP_TimerIntDisable                                                   \
        ROM_TimerIntDisable
#else
#define MAP_TimerIntDisable                                                   \
        TimerIntDisable
#endif
#ifdef ROM_TimerIntStatus
#define MAP_TimerIntStatus                                                    \
        ROM_TimerIntStatus
#else
#define MAP_TimerIntStatus                                                    \
        TimerIntStatus
#endif
#ifdef ROM_TimerControlWaitOnTrigger
#define MAP_TimerControlWaitOnTrigger                                         \
        ROM_TimerControlWaitOnTrigger
#else
#define MAP_TimerControlWaitOnTrigger                                         \
        TimerControlWaitOnTrigger
#endif
#ifdef ROM_TimerLoadSet64
#define MAP_TimerLoadSet64                                                    \
        ROM_TimerLoadSet64
#else
#define MAP_TimerLoadSet64                                                    \
        TimerLoadSet64
#endif
#ifdef ROM_TimerLoadGet64
#define MAP_TimerLoadGet64                                                    \
        ROM_TimerLoadGet64
#else
#define MAP_TimerLoadGet64                                                    \
        TimerLoadGet64
#endif
#ifdef ROM_TimerValueGet64
#define MAP_TimerValueGet64                                                   \
        ROM_TimerValueGet64
#else
#define MAP_TimerValueGet64                                                   \
        TimerValueGet64
#endif
#ifdef ROM_TimerMatchSet64
#define MAP_TimerMatchSet64                                                   \
        ROM_TimerMatchSet64
#else
#define MAP_TimerMatchSet64                                                   \
        TimerMatchSet64
#endif
#ifdef ROM_TimerMatchGet64
#define MAP_TimerMatchGet64                                                   \
        ROM_TimerMatchGet64
#else
#define MAP_TimerMatchGet64                                                   \
        TimerMatchGet64
#endif
#ifdef ROM_TimerClockSourceGet
#define MAP_TimerClockSourceGet                                               \
        ROM_TimerClockSourceGet
#else
#define MAP_TimerClockSourceGet                                               \
        TimerClockSourceGet
#endif
#ifdef ROM_TimerClockSourceSet
#define MAP_TimerClockSourceSet                                               \
        ROM_TimerClockSourceSet
#else
#define MAP_TimerClockSourceSet                                               \
        TimerClockSourceSet
#endif
#ifdef ROM_TimerADCEventGet
#define MAP_TimerADCEventGet                                                  \
        ROM_TimerADCEventGet
#else
#define MAP_TimerADCEventGet                                                  \
        TimerADCEventGet
#endif
#ifdef ROM_TimerADCEventSet
#define MAP_TimerADCEventSet                                                  \
        ROM_TimerADCEventSet
#else
#define MAP_TimerADCEventSet                                                  \
        TimerADCEventSet
#endif
#ifdef ROM_TimerDMAEventGet
#define MAP_TimerDMAEventGet                                                  \
        ROM_TimerDMAEventGet
#else
#define MAP_TimerDMAEventGet                                                  \
        TimerDMAEventGet
#endif
#ifdef ROM_TimerDMAEventSet
#define MAP_TimerDMAEventSet                                                  \
        ROM_TimerDMAEventSet
#else
#define MAP_TimerDMAEventSet                                                  \
        TimerDMAEventSet
#endif
#ifdef ROM_TimerSynchronize
#define MAP_TimerSynchronize                                                  \
        ROM_TimerSynchronize
#else
#define MAP_TimerSynchronize                                                  \
        TimerSynchronize
#endif

//*****************************************************************************
//
// Macros for the UART API.
//
//*****************************************************************************
#ifdef ROM_UARTCharPut
#define MAP_UARTCharPut                                                       \
        ROM_UARTCharPut
#else
#define MAP_UARTCharPut                                                       \
        UARTCharPut
#endif
#ifdef ROM_UARTParityModeSet
#define MAP_UARTParityModeSet                                                 \
        ROM_UARTParityModeSet
#else
#define MAP_UARTParityModeSet                                                 \
        UARTParityModeSet
#endif
#ifdef ROM_UARTParityModeGet
#define MAP_UARTParityModeGet                                                 \
        ROM_UARTParityModeGet
#else
#define MAP_UARTParityModeGet                                                 \
        UARTParityModeGet
#endif
#ifdef ROM_UARTFIFOLevelSet
#define MAP_UARTFIFOLevelSet                                                  \
        ROM_UARTFIFOLevelSet
#else
#define MAP_UARTFIFOLevelSet                                                  \
        UARTFIFOLevelSet
#endif
#ifdef ROM_UARTFIFOLevelGet
#define MAP_UARTFIFOLevelGet                                                  \
        ROM_UARTFIFOLevelGet
#else
#define MAP_UARTFIFOLevelGet                                                  \
        UARTFIFOLevelGet
#endif
#ifdef ROM_UARTConfigSetExpClk
#define MAP_UARTConfigSetExpClk                                               \
        ROM_UARTConfigSetExpClk
#else
#define MAP_UARTConfigSetExpClk                                               \
        UARTConfigSetExpClk
#endif
#ifdef ROM_UARTConfigGetExpClk
#define MAP_UARTConfigGetExpClk                                               \
        ROM_UARTConfigGetExpClk
#else
#define MAP_UARTConfigGetExpClk                                               \
        UARTConfigGetExpClk
#endif
#ifdef ROM_UARTEnable
#define MAP_UARTEnable                                                        \
        ROM_UARTEnable
#else
#define MAP_UARTEnable                                                        \
        UARTEnable
#endif
#ifdef ROM_UARTDisable
#define MAP_UARTDisable                                                       \
        ROM_UARTDisable
#else
#define MAP_UARTDisable                                                       \
        UARTDisable
#endif
#ifdef ROM_UARTEnableSIR
#define MAP_UARTEnableSIR                                                     \
        ROM_UARTEnableSIR
#else
#define MAP_UARTEnableSIR                                                     \
        UARTEnableSIR
#endif
#ifdef ROM_UARTDisableSIR
#define MAP_UARTDisableSIR                                                    \
        ROM_UARTDisableSIR
#else
#define MAP_UARTDisableSIR                                                    \
        UARTDisableSIR
#endif
#ifdef ROM_UARTCharsAvail
#define MAP_UARTCharsAvail                                                    \
        ROM_UARTCharsAvail
#else
#define MAP_UARTCharsAvail                                                    \
        UARTCharsAvail
#endif
#ifdef ROM_UARTSpaceAvail
#define MAP_UARTSpaceAvail                                                    \
        ROM_UARTSpaceAvail
#else
#define MAP_UARTSpaceAvail                                                    \
        UARTSpaceAvail
#endif
#ifdef ROM_UARTCharGetNonBlocking
#define MAP_UARTCharGetNonBlocking                                            \
        ROM_UARTCharGetNonBlocking
#else
#define MAP_UARTCharGetNonBlocking                                            \
        UARTCharGetNonBlocking
#endif
#ifdef ROM_UARTCharGet
#define MAP_UARTCharGet                                                       \
        ROM_UARTCharGet
#else
#define MAP_UARTCharGet                                                       \
        UARTCharGet
#endif
#ifdef ROM_UARTCharPutNonBlocking
#define MAP_UARTCharPutNonBlocking                                            \
        ROM_UARTCharPutNonBlocking
#else
#define MAP_UARTCharPutNonBlocking                                            \
        UARTCharPutNonBlocking
#endif
#ifdef ROM_UARTBreakCtl
#define MAP_UARTBreakCtl                                                      \
        ROM_UARTBreakCtl
#else
#define MAP_UARTBreakCtl                                                      \
        UARTBreakCtl
#endif
#ifdef ROM_UARTIntEnable
#define MAP_UARTIntEnable                                                     \
        ROM_UARTIntEnable
#else
#define MAP_UARTIntEnable                                                     \
        UARTIntEnable
#endif
#ifdef ROM_UARTIntDisable
#define MAP_UARTIntDisable                                                    \
        ROM_UARTIntDisable
#else
#define MAP_UARTIntDisable                                                    \
        UARTIntDisable
#endif
#ifdef ROM_UARTIntStatus
#define MAP_UARTIntStatus                                                     \
        ROM_UARTIntStatus
#else
#define MAP_UARTIntStatus                                                     \
        UARTIntStatus
#endif
#ifdef ROM_UARTIntClear
#define MAP_UARTIntClear                                                      \
        ROM_UARTIntClear
#else
#define MAP_UARTIntClear                                                      \
        UARTIntClear
#endif
#ifdef ROM_UARTDMAEnable
#define MAP_UARTDMAEnable                                                     \
        ROM_UARTDMAEnable
#else
#define MAP_UARTDMAEnable                                                     \
        UARTDMAEnable
#endif
#ifdef ROM_UARTDMADisable
#define MAP_UARTDMADisable                                                    \
        ROM_UARTDMADisable
#else
#define MAP_UARTDMADisable                                                    \
        UARTDMADisable
#endif
#ifdef ROM_UARTFIFOEnable
#define MAP_UARTFIFOEnable                                                    \
        ROM_UARTFIFOEnable
#else
#define MAP_UARTFIFOEnable                                                    \
        UARTFIFOEnable
#endif
#ifdef ROM_UARTFIFODisable
#define MAP_UARTFIFODisable                                                   \
        ROM_UARTFIFODisable
#else
#define MAP_UARTFIFODisable                                                   \
        UARTFIFODisable
#endif
#ifdef ROM_UARTBusy
#define MAP_UARTBusy                                                          \
        ROM_UARTBusy
#else
#define MAP_UARTBusy                                                          \
        UARTBusy
#endif
#ifdef ROM_UARTTxIntModeSet
#define MAP_UARTTxIntModeSet                                                  \
        ROM_UARTTxIntModeSet
#else
#define MAP_UARTTxIntModeSet                                                  \
        UARTTxIntModeSet
#endif
#ifdef ROM_UARTTxIntModeGet
#define MAP_UARTTxIntModeGet                                                  \
        ROM_UARTTxIntModeGet
#else
#define MAP_UARTTxIntModeGet                                                  \
        UARTTxIntModeGet
#endif
#ifdef ROM_UARTRxErrorGet
#define MAP_UARTRxErrorGet                                                    \
        ROM_UARTRxErrorGet
#else
#define MAP_UARTRxErrorGet                                                    \
        UARTRxErrorGet
#endif
#ifdef ROM_UARTRxErrorClear
#define MAP_UARTRxErrorClear                                                  \
        ROM_UARTRxErrorClear
#else
#define MAP_UARTRxErrorClear                                                  \
        UARTRxErrorClear
#endif
#ifdef ROM_UARTClockSourceSet
#define MAP_UARTClockSourceSet                                                \
        ROM_UARTClockSourceSet
#else
#define MAP_UARTClockSourceSet                                                \
        UARTClockSourceSet
#endif
#ifdef ROM_UARTClockSourceGet
#define MAP_UARTClockSourceGet                                                \
        ROM_UARTClockSourceGet
#else
#define MAP_UARTClockSourceGet                                                \
        UARTClockSourceGet
#endif
#ifdef ROM_UART9BitEnable
#define MAP_UART9BitEnable                                                    \
        ROM_UART9BitEnable
#else
#define MAP_UART9BitEnable                                                    \
        UART9BitEnable
#endif
#ifdef ROM_UART9BitDisable
#define MAP_UART9BitDisable                                                   \
        ROM_UART9BitDisable
#else
#define MAP_UART9BitDisable                                                   \
        UART9BitDisable
#endif
#ifdef ROM_UART9BitAddrSet
#define MAP_UART9BitAddrSet                                                   \
        ROM_UART9BitAddrSet
#else
#define MAP_UART9BitAddrSet                                                   \
        UART9BitAddrSet
#endif
#ifdef ROM_UART9BitAddrSend
#define MAP_UART9BitAddrSend                                                  \
        ROM_UART9BitAddrSend
#else
#define MAP_UART9BitAddrSend                                                  \
        UART9BitAddrSend
#endif
#ifdef ROM_UARTSmartCardDisable
#define MAP_UARTSmartCardDisable                                              \
        ROM_UARTSmartCardDisable
#else
#define MAP_UARTSmartCardDisable                                              \
        UARTSmartCardDisable
#endif
#ifdef ROM_UARTSmartCardEnable
#define MAP_UARTSmartCardEnable                                               \
        ROM_UARTSmartCardEnable
#else
#define MAP_UARTSmartCardEnable                                               \
        UARTSmartCardEnable
#endif
#ifdef ROM_UARTModemControlClear
#define MAP_UARTModemControlClear                                             \
        ROM_UARTModemControlClear
#else
#define MAP_UARTModemControlClear                                             \
        UARTModemControlClear
#endif
#ifdef ROM_UARTModemControlGet
#define MAP_UARTModemControlGet                                               \
        ROM_UARTModemControlGet
#else
#define MAP_UARTModemControlGet                                               \
        UARTModemControlGet
#endif
#ifdef ROM_UARTModemControlSet
#define MAP_UARTModemControlSet                                               \
        ROM_UARTModemControlSet
#else
#define MAP_UARTModemControlSet                                               \
        UARTModemControlSet
#endif
#ifdef ROM_UARTModemStatusGet
#define MAP_UARTModemStatusGet                                                \
        ROM_UARTModemStatusGet
#else
#define MAP_UARTModemStatusGet                                                \
        UARTModemStatusGet
#endif
#ifdef ROM_UARTFlowControlGet
#define MAP_UARTFlowControlGet                                                \
        ROM_UARTFlowControlGet
#else
#define MAP_UARTFlowControlGet                                                \
        UARTFlowControlGet
#endif
#ifdef ROM_UARTFlowControlSet
#define MAP_UARTFlowControlSet                                                \
        ROM_UARTFlowControlSet
#else
#define MAP_UARTFlowControlSet                                                \
        UARTFlowControlSet
#endif

